# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with P3/8 - P5/32 outputs
# Ablation: P2=False, DySample=False, BiFPN=True

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [[4, 6, 9], 1, BiFPN, [256, 3, 1.0e-4, False]]
  - [10, 1, Index, [0]]
  - [10, 1, Index, [1]]
  - [10, 1, Index, [2]]

  - [11, 3, C2f, [256]] # P3/8
  - [12, 3, C2f, [512]] # P4/16
  - [13, 3, C2f, [1024]] # P5/32

  - [[14, 15, 16], 1, Detect, [nc]]

