# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5 object detection model with P3/8 - P5/32 outputs
# Ablation: P2=False, DySample=True, BiFPN=True

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [[4, 6, 9], 1, BiFPN, [256, 3, 1.0e-4, True]]
  - [10, 1, Index, [0]]
  - [10, 1, Index, [1]]
  - [10, 1, Index, [2]]

  - [11, 3, C3, [256, False]] # P3/8
  - [12, 3, C3, [512, False]] # P4/16
  - [13, 3, C3, [1024, False]] # P5/32

  - [[14, 15, 16], 1, Detect, [nc]]

