# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5 object detection model with P2/4 - P5/32 outputs (improved with DySample + BiFPN)
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone with P2
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv5 head with P2 + DySample + BiFPN
head:
  # BiFPN fusion on backbone outputs [P2, P3, P4, P5]
  - [[2, 4, 6, 9], 1, BiFPN, [256, 4, 1.0e-4, True]]
  - [10, 1, Index, [0]] # P2
  - [10, 1, Index, [1]] # P3
  - [10, 1, Index, [2]] # P4
  - [10, 1, Index, [3]] # P5

  - [11, 3, C3, [128, False]] # P2 refine
  - [12, 3, C3, [256, False]] # P3 refine
  - [13, 3, C3, [512, False]] # P4 refine
  - [14, 3, C3, [1024, False]] # P5 refine

  - [[15, 16, 17, 18], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
