# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5 object detection model with P2/4 - P5/32 outputs (improved with DySample + SPD2)
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 backbone with P2 + SPD2 (replace P1->P2 and P2->P3 downsamples)
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, SPDConv, [128, 3]] # 1-P2/4, SPD downsampling
  - [-1, 3, C3, [128]]
  - [-1, 1, SPDConv, [256, 3]] # 3-P3/8, SPD downsampling
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv5 head with P2 + DySample upsample
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, DySample, [2]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DySample, [2]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [256, False]] # 16

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DySample, [2]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C3, [128, False]] # 19 (P2/4)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 3, C3, [256, False]] # 22 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3, [512, False]] # 25 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3, [1024, False]] # 28 (P5/32-large)

  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
