# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P2/4 - P5/32 outputs (improved with DySample + BiFPN)
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26 backbone with P2
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26 head with P2 + DySample + BiFPN
head:
  # BiFPN fusion on backbone outputs [P2, P3, P4, P5]
  - [[2, 4, 6, 10], 1, BiFPN, [256, 4, 1.0e-4, True]]
  - [11, 1, Index, [0]] # P2
  - [11, 1, Index, [1]] # P3
  - [11, 1, Index, [2]] # P4
  - [11, 1, Index, [3]] # P5

  - [12, 2, C3k2, [256, False]] # P2 refine
  - [13, 2, C3k2, [256, False]] # P3 refine
  - [14, 2, C3k2, [512, False]] # P4 refine
  - [15, 2, C3k2, [1024, True]] # P5 refine

  - [[16, 17, 18, 19], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
