# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P2/4 - P5/32 outputs (improved with DySample + BiFPN)
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12 backbone with P2
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

# YOLO12 head with P2 + DySample + BiFPN
head:
  # BiFPN fusion on backbone outputs [P2, P3, P4, P5]
  - [[2, 4, 6, 8], 1, BiFPN, [256, 4, 1.0e-4, True]]
  - [9, 1, Index, [0]] # P2
  - [9, 1, Index, [1]] # P3
  - [9, 1, Index, [2]] # P4
  - [9, 1, Index, [3]] # P5

  - [10, 2, C3k2, [128, False]] # P2 refine
  - [11, 2, C3k2, [256, False]] # P3 refine
  - [12, 2, C3k2, [512, False]] # P4 refine
  - [13, 2, A2C2f, [1024, True, 1]] # P5 refine

  - [[14, 15, 16, 17], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
